nc: 1
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]               # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2, 1, 2]]        # 1-P2/4  вҶ’ 64Г—64, ch=32(scaled)
  - [-1, 2, DSC3k2, [256, False, 0.25]]     # 2
  - [-1, 1, Conv, [256, 3, 2, 1, 4]]        # 3-P3/8
  - [-1, 2, DSC3k2, [512, False, 0.25]]     # 4-P3    вҶ’ 32Г—32
  - [-1, 1, DSConv, [512, 3, 2]]            # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]]          # 6-P4    вҶ’ 16Г—16
  - [-1, 1, DSConv, [1024, 3, 2]]           # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]]         # 8-P5    вҶ’ 8Г—8

head:
  # ===== HyperACE + FullPAD =====
  - [[4, 6, 8], 2, HyperACE, [512, 8, True, True, 0.5, 1, "both"]]  # 9  вҶ’ 16Г—16
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]                        # 10 вҶ’ 32Г—32
  - [9, 1, DownsampleConv, []]                                        # 11 вҶ’ 8Г—8
  - [[6, 9], 1, FullPAD_Tunnel, []]   # 12 P4 tunnel  (16Г—16 вң“)
  - [[4, 10], 1, FullPAD_Tunnel, []]  # 13 P3 tunnel  (32Г—32 вң“)
  - [[8, 11], 1, FullPAD_Tunnel, []]  # 14 P5 tunnel  (8Г—8  вң“)

  # ===== P4 иһҚеҗҲ =====
  - [14, 1, nn.Upsample, [None, 2, "nearest"]]  # 15 P5дёҠйҮҮж ·вҶ’P4 16Г—16
  - [[-1, 12], 1, Concat, [1]]                   # 16
  - [-1, 2, DSC3k2, [512, True]]                 # 17 P4иһҚеҗҲ
  - [[-1, 9], 1, FullPAD_Tunnel, []]             # 18 P4 FullPAD (16Г—16 вң“)

  # ===== P3 иһҚеҗҲ =====
  - [17, 1, nn.Upsample, [None, 2, "nearest"]]   # 19 P4вҶ’P3 32Г—32
  - [[-1, 13], 1, Concat, [1]]                   # 20
  - [-1, 2, DSC3k2, [256, True]]                 # 21 P3иһҚеҗҲ 32Г—32

  # ===== P3 1Г—1жҠ•еҪұ + FullPAD =====
  - [10, 1, Conv, [256, 1, 1]]                   # 22 P3жҠ•еҪұ 32Г—32 вң“
  - [[21, 22], 1, FullPAD_Tunnel, []]            # 23 P3 FullPAD (32Г—32 вң“)

  # ===== P2 еҲҶж”Ҝ =====
  - [21, 1, nn.Upsample, [None, 2, "nearest"]]   # 24 P3вҶ’P2 64Г—64
  - [[-1, 1], 1, Concat, [1]]                    # 25 cat backbone P2
  - [-1, 2, DSC3k2, [128, False]]                # 26 P2иһҚеҗҲ 64Г—64
  - [9, 1, nn.Upsample, [None, 4, "nearest"]]    # 27 HyperACEдёҠйҮҮж ·вҶ’64Г—64
  - [-1, 1, Conv, [128, 1, 1]]                   # 28 1Г—1жҠ•еҪұеҲ°128ch
  - [[26, -1], 1, FullPAD_Tunnel, []]            # 29 P2 FullPAD (64Г—64 вң“)

  # ===== PAN дёӢйҮҮж ·пјҡP2вҶ’P3 =====
  - [29, 1, Conv, [256, 3, 2]]                   # 30 P2вҶ’P3 32Г—32
  - [[-1, 23], 1, Concat, [1]]                   # 31
  - [-1, 2, DSC3k2, [256, True]]                 # 32 P3иһҚеҗҲ

  # вҳ… е…ій”®дҝ®еӨҚпјҡHyperACE(16Г—16) жҠ•еҪұз»ҷP3(32Г—32) вҶ’ йңҖдёҠйҮҮж ·Г—2
  - [9, 1, nn.Upsample, [None, 2, "nearest"]]    # 33 HyperACEвҶ’32Г—32
  - [-1, 1, Conv, [256, 1, 1]]                   # 34 1Г—1жҠ•еҪұ
  - [[32, -1], 1, FullPAD_Tunnel, []]            # 35 P3 FullPAD (32Г—32 вң“)

  # ===== PAN дёӢйҮҮж ·пјҡP3вҶ’P4 =====
  - [35, 1, Conv, [512, 3, 2]]                   # 36 P3вҶ’P4 16Г—16
  - [[-1, 18], 1, Concat, [1]]                   # 37
  - [-1, 2, DSC3k2, [512, True]]                 # 38 P4иһҚеҗҲ
  - [[-1, 9], 1, FullPAD_Tunnel, []]             # 39 P4 FullPAD (16Г—16 вң“)

  # ===== PAN дёӢйҮҮж ·пјҡP4вҶ’P5 =====
  - [38, 1, Conv, [1024, 3, 2]]                  # 40 P4вҶ’P5 8Г—8
  - [[-1, 14], 1, Concat, [1]]                   # 41
  - [-1, 2, DSC3k2, [1024, True]]               # 42 P5иһҚеҗҲ
  - [[-1, 11], 1, FullPAD_Tunnel, []]            # 43 P5 FullPAD (8Г—8 вң“)

  # ===== еӣӣе°әеәҰжЈҖжөӢеӨҙ P2/P3/P4/P5 =====
  - [[29, 35, 39, 43], 1, Detect, [nc]]          # 44